### Part 1: Web Scraping (Using Python)

In [5]:
import requests
from bs4 import BeautifulSoup
from tqdm import tqdm
import pandas as pd
import re

In [24]:
url = "https://books.toscrape.com/catalogue/page-.html"
all_link = []
for i in range(1,51):
    j = f'https://books.toscrape.com/catalogue/page-{i}.html'
    all_link.append(j)

all_link

['https://books.toscrape.com/catalogue/page-1.html',
 'https://books.toscrape.com/catalogue/page-2.html',
 'https://books.toscrape.com/catalogue/page-3.html',
 'https://books.toscrape.com/catalogue/page-4.html',
 'https://books.toscrape.com/catalogue/page-5.html',
 'https://books.toscrape.com/catalogue/page-6.html',
 'https://books.toscrape.com/catalogue/page-7.html',
 'https://books.toscrape.com/catalogue/page-8.html',
 'https://books.toscrape.com/catalogue/page-9.html',
 'https://books.toscrape.com/catalogue/page-10.html',
 'https://books.toscrape.com/catalogue/page-11.html',
 'https://books.toscrape.com/catalogue/page-12.html',
 'https://books.toscrape.com/catalogue/page-13.html',
 'https://books.toscrape.com/catalogue/page-14.html',
 'https://books.toscrape.com/catalogue/page-15.html',
 'https://books.toscrape.com/catalogue/page-16.html',
 'https://books.toscrape.com/catalogue/page-17.html',
 'https://books.toscrape.com/catalogue/page-18.html',
 'https://books.toscrape.com/catalogue/page-19.html',
 'https://books.toscrape.com/catalogue/page-20.html',
 'https://books.toscrape.com/catalogue/page-21.html',
 'https://books.toscrape.com/catalogue/page-22.html',
 'https://books.toscrape.com/catalogue/page-23.html',
 'https://books.toscrape.com/catalogue/page-24.html',
 'https://books.toscrape.com/catalogue/page-25.html',
 'https://books.toscrape.com/catalogue/page-26.html',
 'https://books.toscrape.com/catalogue/page-27.html',
 'https://books.toscrape.com/catalogue/page-28.html',
 'https://books.toscrape.com/catalogue/page-29.html',
 'https://books.toscrape.com/catalogue/page-30.html',
 'https://books.toscrape.com/catalogue/page-31.html',
 'https://books.toscrape.com/catalogue/page-32.html',
 'https://books.toscrape.com/catalogue/page-33.html',
 'https://books.toscrape.com/catalogue/page-34.html',
 'https://books.toscrape.com/catalogue/page-35.html',
 'https://books.toscrape.com/catalogue/page-36.html',
 'https://books.toscrape.com/catalogue/page-37.html',
 'https://books.toscrape.com/catalogue/page-38.html',
 'https://books.toscrape.com/catalogue/page-39.html',
 'https://books.toscrape.com/catalogue/page-40.html',
 'https://books.toscrape.com/catalogue/page-41.html',
 'https://books.toscrape.com/catalogue/page-42.html',
 'https://books.toscrape.com/catalogue/page-43.html',
 'https://books.toscrape.com/catalogue/page-44.html',
 'https://books.toscrape.com/catalogue/page-45.html',
 'https://books.toscrape.com/catalogue/page-46.html',
 'https://books.toscrape.com/catalogue/page-47.html',
 'https://books.toscrape.com/catalogue/page-48.html',
 'https://books.toscrape.com/catalogue/page-49.html',
 'https://books.toscrape.com/catalogue/page-50.html']

In [25]:
Title = []
Price = []
Availability = []
Rating = []
for i in tqdm(all_link):
    data = requests.get(i)
    soup = BeautifulSoup(data.text, "html.parser")
    container = soup.find_all('li', class_ = "col-xs-6 col-sm-4 col-md-3 col-lg-3")
    for i in container:
        try:
            Title.append(i.h3.a['title'])
        except:
            Title.append(None)
        try:
            value = i.find("p", class_ = "price_color").text
            final_value = float(re.sub(r'[^0-9.]',"", value))
            #re.sub use for replace all the word exclude that letter which is mention inside the sqaure bracket
            Price.append(final_value)
        except:
            Price.append(None)
        try:
            Availability.append(i.find("p", class_ = "instock availability").get_text(strip = True))
            #Here I am getting multiple spaces so that i use strip
        except:
            Availability.append(None)
        try:
            k = i.find('p', class_='star-rating').get('class')
            l = k[1].lower()
            if l == "one":
                Rating.append(1) #here is the value written in words so I converted into the number
            elif l == "two":
                Rating.append(2)
            elif l == "three":
                Rating.append(3)
            elif l == "four":
                Rating.append(4)
            elif l == "five":
                Rating.append(5)
            else:
                Rating.append(0)
        except:
            Rating.append(None)

100%|██████████| 50/50 [01:27<00:00,  1.76s/it]

In [26]:
len(Title)

1000

In [5]:
len(Availability)

1000

In [6]:
len(Price)

1000

In [7]:
len(Rating)

1000

In [27]:
df = pd.DataFrame({
    "Title" : Title,
    "Price" : Price,
    "Ratings" : Rating,
    "Availability" : Availability
})
df

,Title,Price,Ratings,Availability
0,A Light in the Attic,51.77,3,In stock
1,Tipping the Velvet,53.74,1,In stock
2,Soumission,50.10,1,In stock
3,Sharp Objects,47.82,4,In stock
4,Sapiens: A Brief History of Humankind,54.23,5,In stock
...,...,...,...,...
995,Alice in Wonderland (Alice's Adventures in Won...,55.53,1,In stock
996,"Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)",57.06,4,In stock
997,A Spy's Devotion (The Regency Spies of London #1),16.97,5,In stock
998,1st to Die (Women's Murder Club #1),53.98,1,In stock
999,"1,000 Places to See Before You Die",26.08,5,In stock

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Title         1000 non-null   object
 1   Price         1000 non-null   float64
 2   Ratings       1000 non-null   int64
 3   Availability  1000 non-null   object
dtypes: float64(1), int64(1), object(2)
memory usage: 31.4+ KB

In [29]:
df.isnull().sum()

Title           0
Price           0
Ratings         0
Availability    0
dtype: int64

In [30]:
df.duplicated().sum()

np.int64(0)

In [ ]:
df.to_csv("Book_Details.csv",index = False)

### Part 2: SQL Insights

In [32]:
from urllib.parse import quote_plus
from sqlalchemy import create_engine
password = "Anaszaki1998@"  # Your actual password with special characters
encoded_password = quote_plus(password)
engine = create_engine(f"mysql+pymysql://root:{encoded_password}@localhost/library")
print("Connected to MySQL successfully!")

#if you want to select manually database and you have created database already so with this you can work on that database

Connected to MySQL successfully!

In [36]:
df.to_sql("Book_Details",con = engine, if_exists = "replace", index = False)
print("Data is imported succesfully")
#this helps you to import your dataframe inside the sql

Data is imported succesfully

C:\Users\User\AppData\Local\Temp\ipykernel_5104\3646342243.py:1: UserWarning: The provided table name 'Book_Details' is not found exactly as such in the database after writing the table, possibly due to case sensitivity issues. Consider using lower case table names.
  df.to_sql("Book_Details",con = engine, if_exists = "replace", index = False)

In [1]:
import mysql.connector

In [2]:
conn = mysql.connector.connect(
    host = "localhost",
    user = "root",
    password = "Anaszaki1998@"
)
cursor = conn.cursor()

# with this you can connect your mysql workbench

In [3]:
conn.database = "library"

In [6]:
cursor.execute("SELECT * FROM Book_Details;")
rows = cursor.fetchall()
pd.DataFrame(rows)

                                                     0      1  2         3
0                                 A Light in the Attic  51.77  3  In stock
1                                   Tipping the Velvet  53.74  1  In stock
2                                           Soumission  50.10  1  In stock
3                                        Sharp Objects  47.82  4  In stock
4                Sapiens: A Brief History of Humankind  54.23  5  In stock
..                                                 ...    ... ..       ...
995  Alice in Wonderland (Alice's Adventures in Won...  55.53  1  In stock
996   Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)  57.06  4  In stock
997  A Spy's Devotion (The Regency Spies of London #1)  16.97  5  In stock
998                1st to Die (Women's Murder Club #1)  53.98  1  In stock
999                 1,000 Places to See Before You Die  26.08  5  In stock

[1000 rows x 4 columns]

In [7]:
cursor.execute("SELECT * FROM Book_Details;")
rows = cursor.fetchall()

# Get column names from cursor.description
columns = [desc[0] for desc in cursor.description]


df = pd.DataFrame
# Create DataFrame with column names
df(rows, columns=columns)

,Title,Price,Ratings,Availability
0,A Light in the Attic,51.77,3,In stock
1,Tipping the Velvet,53.74,1,In stock
2,Soumission,50.10,1,In stock
3,Sharp Objects,47.82,4,In stock
4,Sapiens: A Brief History of Humankind,54.23,5,In stock
...,...,...,...,...
995,Alice in Wonderland (Alice's Adventures in Won...,55.53,1,In stock
996,"Ajin: Demi-Human, Volume 1 (Ajin: Demi-Human #1)",57.06,4,In stock
997,A Spy's Devotion (The Regency Spies of London #1),16.97,5,In stock
998,1st to Die (Women's Murder Club #1),53.98,1,In stock
999,"1,000 Places to See Before You Die",26.08,5,In stock

1. **Find the number of books available in stock.**

In [42]:
cursor.execute("SELECT COUNT(Title) as Number_Of_Books FROM Book_Details WHERE Availability = 'In Stock';")
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns = columns)
# I have already mentioned df = pd.DataFrame

   Number_Of_Books
0             1000

2. **List the top 5 most expensive books.**

In [43]:
cursor.execute(
    "SELECT Title, Price "
    "FROM Book_Details "
    "ORDER BY Price DESC "
    "LIMIT 5;"
)

rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns = columns)

                                Title  Price
0  The Perfect Play (Play by Play #1)  59.99
1   Last One Home (New Beginnings #1)  59.98
2    Civilization and Its Discontents  59.95
3      The Barefoot Contessa Cookbook  59.92
4           The Diary of a Young Girl  59.90

3. **List the top 5 most cheapest books.**

In [55]:
cursor.execute(
    "SELECT Title, Price "
    "FROM Book_Details "
    "ORDER BY Price "
    "LIMIT 05; "
)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns=columns)

                                               Title  Price
0                         An Abundance of Katherines  10.00
1                              The Origin of Species  10.01
2  The Tipping Point: How Little Things Can Make ...  10.02
3                                           Patience  10.16
4                               Greek Mythic History  10.23

4. **Find the average rating of books.**

In [45]:
cursor.execute(
    "SELECT AVG(Ratings) as Average_rating "
    "FROM Book_Details; "
)

rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns = columns)

  Average_rating
0         2.9230

5. **Retrieve the total number of books for each rating (e.g., 1-star, 2-star, etc.).**

In [51]:
cursor.execute(
    "SELECT Ratings, COUNT(Ratings) as Number_Of_Books "
    "FROM Book_Details "
    "GROUP BY Ratings "
    "ORDER BY Ratings; ")
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns= columns)

   Ratings  Number_Of_Books
0        1              226
1        2              196
2        3              203
3        4              179
4        5              196

6. **What is the average price of books for each rating category?**

In [57]:
cursor.execute(
    "SELECT Ratings, ROUND(AVG(Price),2) as avg_price "
    "FROM Book_Details "
    "GROUP BY Ratings "
    "ORDER BY Ratings; "
)
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns = columns)

   Ratings  avg_price
0        1      34.56
1        2      34.81
2        3      34.69
3        4      36.09
4        5      35.37

7. **How many books fall into different price ranges (e.g., 0-25, 26-50, etc.)**

In [8]:
cursor.execute("""
SELECT 
    CASE  
        WHEN Price >= 0 AND Price <= 25 THEN '0-25'
        WHEN Price > 25 AND Price <= 50 THEN '26-50'
        WHEN Price > 50 AND Price <= 75 THEN '51-75'
        ELSE '75+'
    END AS Price_Range,
    COUNT(*) AS book_count  
FROM Book_Details  
GROUP BY Price_Range  
ORDER BY Price_Range;
""")

rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns=columns)

  Price_Range  book_count
0        0-25         299
1       26-50         503
2       51-75         198

8. **Which books have a price more than the average price?**

In [9]:
cursor.execute("""
SELECT Title, Price
FROM Book_Details
WHERE Price > (SELECT AVG(Price) FROM Book_Details)
ORDER BY Price DESC;
""")
rows = cursor.fetchall()
columns = [desc[0] for desc in cursor.description]
df(rows, columns=columns)

                                                 Title  Price
0                   The Perfect Play (Play by Play #1)  59.99
1                    Last One Home (New Beginnings #1)  59.98
2                     Civilization and Its Discontents  59.95
3                       The Barefoot Contessa Cookbook  59.92
4                            The Diary of a Young Girl  59.90
..                                                 ...    ...
508                  Doing It Over (Most Likely To #1)  35.61
509  So Cute It Hurts!!, Vol. 6 (So Cute It Hurts!!...  35.43
510                                    The Darkest Lie  35.35
511                                        Most Wanted  35.28
512                        Breaking Dawn (Twilight #4)  35.28

[513 rows x 2 columns]

In [10]:
# Break or Connection between SQL and Python
cursor.close()

True

In [11]:
conn.close()